# SpecifiedAnglesNotCompatibleWithLayoutError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..SpecifiedAnglesNotCompatibleWithLayoutError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The specified angles are not compatible with current layout.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpecifiedAnglesNotCompatibleWithLayoutError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpecifiedAnglesNotCompatibleWithLayoutError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpecifiedAnglesNotCompatibleWithLayoutError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace